# Контрольная работа по C++ (Уроки 1-8)

**Время выполнения:** 60 минут  
**Максимальный балл:** 60 баллов

---

## Вариант 1

### Теоретическая часть (20 баллов)

**Вопрос 1 (5 баллов)**  
Какой тип данных в C++ используется для хранения логических значений (истина/ложь)? Какие два значения может принимать переменная этого типа?

**Вопрос 2 (5 баллов)**  
В чём разница между операторами `++x` (префиксный инкремент) и `x++` (постфиксный инкремент)? Приведите пример, демонстрирующий различие.

**Вопрос 3 (5 баллов)**  
Что такое указатель в C++? Какой оператор используется для получения адреса переменной, а какой — для разыменования указателя?

**Вопрос 4 (5 баллов)**  
В чём разница между циклами `while` и `do-while`? Когда следует использовать `do-while`?

---

### Практическая часть (40 баллов)

**Задание 1 (20 баллов)**  
Определите, чему будет равно значение переменной `result` после выполнения следующего кода:

```cpp
int a = 10;
int b = 3;
int result = 0;

result = a / b + a % b;
result *= 2;
result -= 5;
```

**Ответ:** ___________

---

**Задание 2 (20 баллов)**  
Дан массив: `int arr[5] = {2, 7, 4, 9, 3};`

Определите, какое значение выведет следующий код:

```cpp
int sum = 0;
for (int i = 0; i < 5; i++) {
    if (arr[i] % 2 == 1) {
        sum += arr[i];
    }
}
cout << sum;
```

**Ответ:** ___________

---

## Вариант 2

### Теоретическая часть (20 баллов)

**Вопрос 1 (5 баллов)**  
Какой размер в байтах обычно занимает тип `int` в C++? Какой диапазон значений он может хранить (приблизительно)?

**Вопрос 2 (5 баллов)**  
Что такое тернарный оператор в C++? Напишите его синтаксис и приведите пример использования.

**Вопрос 3 (5 баллов)**  
В чём разница между указателем и ссылкой в C++? Назовите минимум 2 отличия.

**Вопрос 4 (5 баллов)**  
С какого индекса начинается нумерация элементов массива в C++? Как получить доступ к последнему элементу массива размером N?

---

### Практическая часть (40 баллов)

**Задание 1 (20 баллов)**  
Определите, чему будет равно значение переменной `x` после выполнения следующего кода:

```cpp
int x = 5;
int y = 3;

x += y * 2;
x = x - (y + 1);
x *= 2;
```

**Ответ:** ___________

---

**Задание 2 (20 баллов)**  
Определите, сколько раз выведется символ `*` при выполнении следующего кода:

```cpp
for (int i = 1; i <= 4; i++) {
    for (int j = 1; j <= i; j++) {
        cout << "*";
    }
}
```

**Ответ:** ___________

---

## Вариант 3

### Теоретическая часть (20 баллов)

**Вопрос 1 (5 баллов)**  
Что делает директива `#include <iostream>` в программе на C++? Какие операции становятся доступны после её подключения?

**Вопрос 2 (5 баллов)**  
Что делают операторы `break` и `continue` в циклах? В чём их отличие?

**Вопрос 3 (5 баллов)**  
Как объявить константу в C++? Можно ли изменить значение константы после её объявления?

**Вопрос 4 (5 баллов)**  
Что такое арифметика указателей? Если `int *ptr` указывает на элемент массива, что произойдёт при выполнении `ptr + 1`?

---

### Практическая часть (40 баллов)

**Задание 1 (20 баллов)**  
Определите, чему будет равно значение переменной `count` после выполнения следующего кода:

```cpp
int count = 0;
for (int i = 1; i <= 20; i++) {
    if (i % 3 == 0 && i % 2 == 0) {
        count++;
    }
}
```

**Ответ:** ___________

---

**Задание 2 (20 баллов)**  
Дан массив: `int arr[6] = {5, 12, 8, 3, 15, 7};`

Определите, какое значение выведет следующий код:

```cpp
int max = arr[0];
int index = 0;
for (int i = 1; i < 6; i++) {
    if (arr[i] > max) {
        max = arr[i];
        index = i;
    }
}
cout << max + index;
```

**Ответ:** ___________

---

## Вариант 4

### Теоретическая часть (20 баллов)

**Вопрос 1 (5 баллов)**  
В чём разница между типами `float` и `double` в C++? Какой из них обеспечивает большую точность?

**Вопрос 2 (5 баллов)**  
Что такое оператор `switch`? С какими типами данных он может работать? Что происходит, если не написать `break` после `case`?

**Вопрос 3 (5 баллов)**  
Как вычислить длину строки типа `std::string`? Какой метод для этого используется?

**Вопрос 4 (5 баллов)**  
Что означает значение `nullptr` для указателя? Почему важно инициализировать указатели перед использованием?

---

### Практическая часть (40 баллов)

**Задание 1 (20 баллов)**  
Определите, чему будет равно значение переменной `result` после выполнения следующего кода:

```cpp
int result = 1;
for (int i = 1; i <= 5; i++) {
    result *= i;
}
result = result / 10;
```

**Ответ:** ___________

---

**Задание 2 (20 баллов)**  
Определите, какое значение выведет следующий код:

```cpp
int a = 8;
int *ptr = &a;

*ptr = *ptr + 7;
a = a * 2;

cout << *ptr;
```

**Ответ:** ___________

