# Проверочная работа по C++ (Уроки 1-10)
## Вариант 4

**Время выполнения:** 60 минут  
**Максимальный балл:** 50 баллов

---

## Теоретическая часть (25 баллов)

**Вопрос 1 (5 баллов)** — *Тема: Урок 2. Переменные и типы данных*  
Что такое тип `char`? Сколько байт он занимает? Как записать символ и его ASCII-код? Приведите пример.

**Вопрос 2 (5 баллов)** — *Тема: Урок 4. Условные операторы*  
Как работает вложенный `if`? Напишите структуру вложенного условия для проверки: число положительное, отрицательное или ноль.

**Вопрос 3 (5 баллов)** — *Тема: Урок 6. Массивы*  
Как инициализировать двумерный массив 2x3? Как получить доступ к элементу во второй строке и третьем столбце?

**Вопрос 4 (5 баллов)** — *Тема: Урок 7. Строки*  
Как найти подстроку в строке типа `string`? Какой метод используется? Что вернёт метод, если подстрока не найдена?

**Вопрос 5 (5 баллов)** — *Тема: Урок 10. Функции*  
Что такое перегрузка функций? Можно ли создать две функции с одинаковым именем? Какие условия для этого нужны?

---

## Практическая часть (25 баллов)

**Задание 1 (8 баллов)** — *Тема: Урок 5. Циклы*  
Определите, чему будет равно значение переменной `sum` после выполнения следующего кода:

```cpp
int sum = 0;
int n = 5;
for (int i = 1; i <= n; i++) {
    sum = sum + i * i;
}
```

**Ответ:** ___________

---

**Задание 2 (8 баллов)** — *Тема: Урок 4. Условия + Урок 6. Массивы*  
Дан массив: `int arr[7] = {4, -2, 7, -5, 3, -1, 6};`

Определите, какое значение выведет следующий код:

```cpp
int positive = 0;
int negative = 0;
for (int i = 0; i < 7; i++) {
    if (arr[i] > 0) {
        positive += arr[i];
    } else {
        negative += arr[i];
    }
}
cout << positive + negative;
```

**Ответ:** ___________

---

**Задание 3 (9 баллов)** — *Тема: Урок 10. Функции (передача по ссылке)*  
Определите, какое значение выведет следующий код:

```cpp
void swap(int &a, int &b) {
    int temp = a;
    a = b;
    b = temp;
}

void increase(int &x, int y) {
    x = x + y;
    y = y * 2;
}

int a = 8;
int b = 3;

swap(a, b);
increase(a, b);

cout << a * b;
```

**Ответ:** ___________

---

## Критерии оценивания:

| Баллы | Оценка |
|-------|--------|
| 45-50 | Отлично (5) |
| 35-44 | Хорошо (4) |
| 25-34 | Удовлетворительно (3) |
| 0-24  | Неудовлетворительно (2) |
