# Проверочная работа по C++ (Уроки 1-10)
## Вариант 3

**Время выполнения:** 60 минут  
**Максимальный балл:** 50 баллов

---

## Теоретическая часть (25 баллов)

**Вопрос 1 (5 баллов)** — *Тема: Урок 2. Переменные и типы данных*  
Что такое константа? Как объявить константу с помощью `const`? Можно ли изменить значение константы после её инициализации?

**Вопрос 2 (5 баллов)** — *Тема: Урок 3. Операторы*  
Как работают логические операторы `&&` (И) и `||` (ИЛИ)? Приведите примеры выражений, которые возвращают `true`.

**Вопрос 3 (5 баллов)** — *Тема: Урок 4. Условные операторы*  
Что произойдёт, если в операторе `switch` забыть написать `break` после `case`? С какими типами данных работает `switch`?

**Вопрос 4 (5 баллов)** — *Тема: Урок 7. Строки*  
В чём разница между C-строками (`char[]`) и типом `string`? Какой метод используется для получения длины `string`?

**Вопрос 5 (5 баллов)** — *Тема: Урок 10. Функции*  
Что такое рекурсивная функция? Почему важен базовый случай в рекурсии?

---

## Практическая часть (25 баллов)

**Задание 1 (8 баллов)** — *Тема: Урок 4. Условия + Урок 5. Циклы*  
Определите, чему будет равно значение переменной `count` после выполнения следующего кода:

```cpp
int count = 0;
for (int i = 1; i <= 15; i++) {
    if (i % 2 != 0 && i % 5 != 0) {
        count++;
    }
}
```

**Ответ:** ___________

---

**Задание 2 (8 баллов)** — *Тема: Урок 5. Циклы (вложенные циклы)*  
Определите, сколько символов `#` выведет следующий код:

```cpp
for (int i = 1; i <= 3; i++) {
    for (int j = 1; j <= 5 - i; j++) {
        cout << "#";
    }
}
```

**Ответ:** ___________

---

**Задание 3 (9 баллов)** — *Тема: Урок 9. Структуры + Урок 10. Функции*  
Определите, какое значение выведет следующий код:

```cpp
struct Rectangle {
    int width;
    int height;
};

int area(Rectangle r) {
    return r.width * r.height;
}

Rectangle rect = {6, 4};
rect.width = rect.width + 2;

int result = area(rect) - rect.height;
cout << result;
```

**Ответ:** ___________

---

## Критерии оценивания:

| Баллы | Оценка |
|-------|--------|
| 45-50 | Отлично (5) |
| 35-44 | Хорошо (4) |
| 25-34 | Удовлетворительно (3) |
| 0-24  | Неудовлетворительно (2) |
