# Проверочная работа по C++ (Уроки 1-10)
## Вариант 2

**Время выполнения:** 60 минут  
**Максимальный балл:** 50 баллов

---

## Теоретическая часть (25 баллов)

**Вопрос 1 (5 баллов)** — *Тема: Урок 2. Переменные и типы данных*  
Что такое приведение типов (casting)? Приведите пример явного приведения типа от `double` к `int`. Что произойдёт с дробной частью?

**Вопрос 2 (5 баллов)** — *Тема: Урок 3. Операторы*  
Каков приоритет арифметических операторов в C++? В каком порядке выполняются операции в выражении `2 + 3 * 4 - 8 / 2`?

**Вопрос 3 (5 баллов)** — *Тема: Урок 4. Условные операторы*  
Что такое тернарный оператор `? :`? Перепишите следующий код с использованием тернарного оператора: `if (x > 0) y = 1; else y = -1;`

**Вопрос 4 (5 баллов)** — *Тема: Урок 7. Строки*  
Как объединить (конкатенировать) две строки типа `string`? Как добавить символ в конец строки? Приведите примеры.

**Вопрос 5 (5 баллов)** — *Тема: Урок 8. Указатели*  
Что такое нулевой указатель (nullptr)? Зачем он нужен? Что произойдёт при попытке разыменовать нулевой указатель?

---

## Практическая часть (25 баллов)

**Задание 1 (8 баллов)** — *Тема: Урок 3. Операторы*  
Определите, чему будет равно значение переменной `x` после выполнения следующего кода:

```cpp
int x = 12;
int y = 7;

x = x % y + y / 2;
y = x * 2 - 1;
x = y % x + 4;
```

**Ответ:** ___________

---

**Задание 2 (8 баллов)** — *Тема: Урок 5. Циклы + Урок 6. Массивы*  
Дан массив: `int arr[6] = {5, 2, 8, 1, 9, 3};`

Определите, какое значение выведет следующий код:

```cpp
int max = arr[0];
int sum = 0;
for (int i = 0; i < 6; i++) {
    if (arr[i] > max) {
        max = arr[i];
    }
    if (arr[i] % 2 == 1) {
        sum += arr[i];
    }
}
cout << max + sum;
```

**Ответ:** ___________

---

**Задание 3 (9 баллов)** — *Тема: Урок 10. Функции*  
Определите, какое значение выведет следующий код:

```cpp
int calculate(int a, int b) {
    return a * a - b;
}

int transform(int x) {
    return x / 2 + 3;
}

int result = calculate(5, 7);
result = transform(result);
result = calculate(result, 4);
cout << result;
```

**Ответ:** ___________

---

## Критерии оценивания:

| Баллы | Оценка |
|-------|--------|
| 45-50 | Отлично (5) |
| 35-44 | Хорошо (4) |
| 25-34 | Удовлетворительно (3) |
| 0-24  | Неудовлетворительно (2) |
