# Проверочная работа по C++ (Уроки 1-10)
## Вариант 1

**Время выполнения:** 60 минут  
**Максимальный балл:** 50 баллов

---

## Теоретическая часть (25 баллов)

**Вопрос 1 (5 баллов)** — *Тема: Урок 1. Введение в C++*  
Что делает оператор `cout` и оператор `endl`? Для чего используется `using namespace std;`?

**Вопрос 2 (5 баллов)** — *Тема: Урок 2. Переменные*  
Что такое переменная? Какие правила именования переменных существуют в C++? Приведите пример правильного и неправильного имени.

**Вопрос 3 (5 баллов)** — *Тема: Урок 3. Операторы*  
Объясните разницу между операторами `=` и `==`. Приведите пример использования каждого.

**Вопрос 4 (5 баллов)** — *Тема: Урок 9. Структуры*  
Что такое структура в C++? Как получить доступ к полю структуры через переменную и через указатель?

**Вопрос 5 (5 баллов)** — *Тема: Урок 10. Функции*  
Что такое функция? В чём разница между объявлением (прототипом) и определением функции?

---

## Практическая часть (25 баллов)

**Задание 1 (8 баллов)** — *Тема: Урок 3. Операторы*  
Определите, чему будет равно значение переменной `result` после выполнения следующего кода:

```cpp
int a = 15;
int b = 4;
int result = 0;

result = a % b + a / b;
result++;
result *= 3;
```

**Ответ:** ___________

---

**Задание 2 (8 баллов)** — *Тема: Урок 4. Условия + Урок 5. Циклы*  
Определите, какое значение выведет следующий код:

```cpp
int sum = 0;
for (int i = 1; i <= 10; i++) {
    if (i % 2 == 0 && i % 3 == 0) {
        sum += i;
    }
}
cout << sum;
```

**Ответ:** ___________

---

**Задание 3 (9 баллов)** — *Тема: Урок 8. Указатели + Урок 9. Структуры*  
Определите, какое значение выведет следующий код:

```cpp
struct Point {
    int x;
    int y;
};

Point p = {5, 10};
Point *ptr = &p;

ptr->x = ptr->x * 2;
ptr->y = p.x + 3;

cout << p.x + p.y;
```

**Ответ:** ___________

---

## Критерии оценивания:

| Баллы | Оценка |
|-------|--------|
| 45-50 | Отлично (5) |
| 35-44 | Хорошо (4) |
| 25-34 | Удовлетворительно (3) |
| 0-24  | Неудовлетворительно (2) |
