# Проверочная работа по C++ (Уроки 1-10)
## Вариант 1

**Время выполнения:** 60 минут  
**Максимальный балл:** 50 баллов

---

## Теоретическая часть (25 баллов)

**Вопрос 1 (5 баллов)** — *Тема: Урок 1. Введение в C++*  
Что такое компиляция? Какой файл создаётся в результате компиляции программы на C++? Что делает директива `#include`?

**Вопрос 2 (5 баллов)** — *Тема: Урок 2. Переменные*  
Чем отличается тип `float` от `double`? Какой из них точнее? Как записать число с плавающей точкой в C++?

**Вопрос 3 (5 баллов)** — *Тема: Урок 3. Операторы*  
Что такое составные операторы присваивания? Приведите примеры операторов `+=`, `-=`, `*=` и объясните, что они делают.

**Вопрос 4 (5 баллов)** — *Тема: Урок 6. Массивы*  
Что произойдёт, если обратиться к элементу массива за его границами? Как определить размер массива, если он объявлен как `int arr[10]`?

**Вопрос 5 (5 баллов)** — *Тема: Урок 10. Функции*  
Что такое область видимости переменной? Чем локальная переменная отличается от глобальной?

---

## Практическая часть (25 баллов)

**Задание 1 (8 баллов)** — *Тема: Урок 3. Операторы*  
Определите, чему будет равно значение переменной `result` после выполнения следующего кода:

```cpp
int a = 20;
int b = 7;
int result = 0;

result = a / b * 2 + a % b;
result -= 3;
result *= 2;
```

**Ответ:** ___________

---

**Задание 2 (8 баллов)** — *Тема: Урок 4. Условия + Урок 5. Циклы*  
Определите, какое значение выведет следующий код:

```cpp
int sum = 0;
for (int i = 1; i <= 20; i++) {
    if (i % 3 == 0 && i % 4 != 0) {
        sum += i;
    }
}
cout << sum;
```

**Ответ:** ___________

---

**Задание 3 (9 баллов)** — *Тема: Урок 8. Указатели + Урок 9. Структуры*  
Определите, какое значение выведет следующий код:

```cpp
struct Box {
    int width;
    int height;
};

Box b = {8, 5};
Box *ptr = &b;

ptr->width = ptr->width + ptr->height;
ptr->height = b.width - 3;

cout << b.width * b.height;
```

**Ответ:** ___________

---

## Критерии оценивания:

| Баллы | Оценка |
|-------|--------|
| 45-50 | Отлично (5) |
| 35-44 | Хорошо (4) |
| 25-34 | Удовлетворительно (3) |
| 0-24  | Неудовлетворительно (2) |
