# Проверочная работа по C++ (Уроки 1-10)
## Вариант 2

**Время выполнения:** 60 минут  
**Максимальный балл:** 50 баллов

---

## Теоретическая часть (25 баллов)

**Вопрос 1 (5 баллов)** — *Тема: Урок 2. Переменные и типы данных*  
Какие основные типы данных для целых чисел существуют в C++? Чем `int` отличается от `short` и `long`?

**Вопрос 2 (5 баллов)** — *Тема: Урок 3. Операторы*  
Что делает оператор остатка от деления `%`? Как с его помощью определить, является ли число чётным?

**Вопрос 3 (5 баллов)** — *Тема: Урок 5. Циклы*  
В чём разница между циклом `for` и циклом `while`? Когда лучше использовать каждый из них?

**Вопрос 4 (5 баллов)** — *Тема: Урок 6. Массивы*  
Как объявить массив в C++? С какого индекса начинается нумерация? Как получить доступ к третьему элементу массива?

**Вопрос 5 (5 баллов)** — *Тема: Урок 10. Функции*  
Что такое передача параметров по значению и по ссылке? В чём их различие?

---

## Практическая часть (25 баллов)

**Задание 1 (8 баллов)** — *Тема: Урок 3. Операторы*  
Определите, чему будет равно значение переменной `x` после выполнения следующего кода:

```cpp
int x = 8;
int y = 5;

x = x + y * 2;
y = x - y;
x = x / y + 3;
```

**Ответ:** ___________

---

**Задание 2 (8 баллов)** — *Тема: Урок 5. Циклы + Урок 6. Массивы*  
Дан массив: `int arr[5] = {4, 1, 7, 2, 9};`

Определите, какое значение выведет следующий код:

```cpp
int min = arr[0];
int pos = 0;
for (int i = 1; i < 5; i++) {
    if (arr[i] < min) {
        min = arr[i];
        pos = i;
    }
}
cout << min * pos;
```

**Ответ:** ___________

---

**Задание 3 (9 баллов)** — *Тема: Урок 10. Функции*  
Определите, какое значение выведет следующий код:

```cpp
int getValue(int a, int b) {
    return a * 2 + b;
}

int process(int x) {
    x = x + 5;
    return x * 2;
}

int result = getValue(3, 4);
result = process(result);
cout << result;
```

**Ответ:** ___________

---

## Критерии оценивания:

| Баллы | Оценка |
|-------|--------|
| 45-50 | Отлично (5) |
| 35-44 | Хорошо (4) |
| 25-34 | Удовлетворительно (3) |
| 0-24  | Неудовлетворительно (2) |
