# Проверочная работа по C++ (Уроки 1-10)
## Вариант 3

**Время выполнения:** 60 минут  
**Максимальный балл:** 50 баллов

---

## Теоретическая часть (25 баллов)

**Вопрос 1 (5 баллов)** — *Тема: Урок 1. Введение в C++*  
Что такое комментарии в C++? Какие два вида комментариев существуют? Приведите примеры каждого вида.

**Вопрос 2 (5 баллов)** — *Тема: Урок 3. Операторы*  
Что такое короткое замыкание (short-circuit evaluation) в логических выражениях? Как оно работает для операторов `&&` и `||`?

**Вопрос 3 (5 баллов)** — *Тема: Урок 5. Циклы*  
В чём разница между циклом `while` и `do-while`? Когда тело цикла `do-while` выполнится хотя бы один раз, даже если условие ложно?

**Вопрос 4 (5 баллов)** — *Тема: Урок 8. Указатели и ссылки*  
Чем указатель отличается от ссылки? Можно ли изменить то, на что указывает ссылка после её инициализации?

**Вопрос 5 (5 баллов)** — *Тема: Урок 9. Структуры*  
Можно ли создавать массивы структур? Как обратиться к полю `name` третьего элемента массива структур `students`?

---

## Практическая часть (25 баллов)

**Задание 1 (8 баллов)** — *Тема: Урок 4. Условия + Урок 5. Циклы*  
Определите, чему будет равно значение переменной `count` после выполнения следующего кода:

```cpp
int count = 0;
for (int i = 10; i <= 30; i++) {
    if (i % 2 == 0 && i % 5 == 0) {
        count++;
    }
}
```

**Ответ:** ___________

---

**Задание 2 (8 баллов)** — *Тема: Урок 5. Циклы (вложенные циклы)*  
Определите, сколько символов `*` выведет следующий код:

```cpp
for (int i = 1; i <= 4; i++) {
    for (int j = 1; j <= i + 1; j++) {
        cout << "*";
    }
}
```

**Ответ:** ___________

---

**Задание 3 (9 баллов)** — *Тема: Урок 9. Структуры + Урок 10. Функции*  
Определите, какое значение выведет следующий код:

```cpp
struct Circle {
    int radius;
    int x;
};

int perimeter(Circle c) {
    return 2 * 3 * c.radius;  // упрощённая формула
}

Circle c1 = {5, 10};
c1.radius = c1.radius + c1.x / 2;

int result = perimeter(c1) / 2;
cout << result;
```

**Ответ:** ___________

---

## Критерии оценивания:

| Баллы | Оценка |
|-------|--------|
| 45-50 | Отлично (5) |
| 35-44 | Хорошо (4) |
| 25-34 | Удовлетворительно (3) |
| 0-24  | Неудовлетворительно (2) |
