# Проверочная работа по C++ (Уроки 1-10)
## Вариант 4

**Время выполнения:** 60 минут  
**Максимальный балл:** 50 баллов

---

## Теоретическая часть (25 баллов)

**Вопрос 1 (5 баллов)** — *Тема: Урок 2. Переменные и типы данных*  
Что такое тип `bool`? Какие значения он может принимать? Что выведет `cout` для значений `true` и `false`?

**Вопрос 2 (5 баллов)** — *Тема: Урок 3. Операторы*  
В чём разница между операторами `++x` (префиксный) и `x++` (постфиксный)? Приведите пример, демонстрирующий различие.

**Вопрос 3 (5 баллов)** — *Тема: Урок 5. Циклы*  
Как работают операторы `break` и `continue` в циклах? В чём их отличие?

**Вопрос 4 (5 баллов)** — *Тема: Урок 8. Указатели и ссылки*  
Что такое указатель? Какой оператор используется для получения адреса переменной, а какой — для разыменования указателя?

**Вопрос 5 (5 баллов)** — *Тема: Урок 10. Функции*  
Что такое параметры функции по умолчанию? Приведите пример объявления функции с параметром по умолчанию.

---

## Практическая часть (25 баллов)

**Задание 1 (8 баллов)** — *Тема: Урок 5. Циклы*  
Определите, чему будет равно значение переменной `n` после выполнения следующего кода:

```cpp
int n = 1;
for (int i = 1; i <= 4; i++) {
    n = n * i + 1;
}
```

**Ответ:** ___________

---

**Задание 2 (8 баллов)** — *Тема: Урок 4. Условия + Урок 6. Массивы*  
Дан массив: `int arr[6] = {3, 8, 2, 10, 5, 1};`

Определите, какое значение выведет следующий код:

```cpp
int sum = 0;
for (int i = 0; i < 6; i++) {
    if (arr[i] > 4) {
        sum += arr[i];
    } else {
        sum -= arr[i];
    }
}
cout << sum;
```

**Ответ:** ___________

---

**Задание 3 (9 баллов)** — *Тема: Урок 10. Функции (передача по ссылке)*  
Определите, какое значение выведет следующий код:

```cpp
void modify(int &a, int b) {
    a = a + b;
    b = b * 2;
}

int x = 10;
int y = 5;

modify(x, y);
modify(x, y);

cout << x + y;
```

**Ответ:** ___________

---

## Критерии оценивания:

| Баллы | Оценка |
|-------|--------|
| 45-50 | Отлично (5) |
| 35-44 | Хорошо (4) |
| 25-34 | Удовлетворительно (3) |
| 0-24  | Неудовлетворительно (2) |
