# Итоговая контрольная работа по C++ (Уроки 1–16)
## Вариант 1

**Время выполнения:** 90 минут  
**Максимальный балл:** 100 баллов

**Темы:** введение, переменные, операторы, условия, циклы, массивы, строки, указатели, структуры, функции, классы, конструкторы, наследование, полиморфизм, перегрузка операторов (теория по файлам — в варианте 4).

**Формат ответов:** теоретические вопросы — **развёрнуто** (3–8 предложений, при необходимости пример кода). Практические — краткий ответ и краткое обоснование (для «найдите ошибку» — список ошибок и исправлений).

---

## Теоретическая часть (30 баллов)

**Вопрос 1 (6 баллов)** — *Урок 1. Введение в C++*  
Что такое компиляция и интерпретация? Чем отличается исходный код от исполняемого файла? Для чего нужны директивы `#include` и зачем в программе функция `main`?

---

**Вопрос 2 (6 баллов)** — *Урок 3. Операторы*  
Объясните разницу между префиксным `++x` и постфиксным `x++`. Что такое составные операторы присваивания (`+=`, `*=`) и логические операторы `&&`, `||`? Приведите по одному примеру.

---

**Вопрос 3 (6 баллов)** — *Урок 5. Циклы*  
Сравните циклы `for`, `while` и `do-while`: когда какой удобнее применять? Что делают `break` и `continue`? Приведите пример ситуации, где `do-while` предпочтительнее `while`.

---

**Вопрос 4 (6 баллов)** — *Урок 10. Функции*  
Что такое объявление (прототип) и определение функции? Чем параметры отличаются от аргументов? Объясните передачу аргумента **по значению** и **по ссылке** (`&`). Когда уместна передача по константной ссылке `const &`?

---

**Вопрос 5 (6 баллов)** — *Урок 14. Наследование*  
Что такое базовый и производный класс? Какие виды наследования бывают (`public`, `protected`, `private`) и что они означают для доступа к членам базового класса? Что такое переопределение (override) метода в производном классе?

---

## Практическая часть (70 баллов)

**Задание 1 (14 баллов)** — *Урок 2. Переменные и типы*  
Определите значение переменной `result` после выполнения кода. Запишите пошаговый разбор.

```cpp
int a = 17;
int b = 5;
double result = a / b;
result = result + a % b;
result *= 2;
```

**Ответ:** ___________

---

**Задание 2 (14 баллов)** — *Урок 4. Условия + Урок 6. Массивы*  
Что выведет программа? Объясните логику.

```cpp
int arr[5] = {3, 8, 2, 8, 5};
int count = 0;
for (int i = 0; i < 5; i++) {
    if (arr[i] >= 5 && arr[i] % 2 == 0) {
        count++;
    } else if (arr[i] < 5) {
        count += 2;
    }
}
cout << count;
```

**Ответ:** ___________

---

**Задание 3 (14 баллов)** — *Урок 9. Структуры*  
В коде **три ошибки**. Найдите их, объясните и напишите исправленный фрагмент.

```cpp
struct Student {
    string name;
    int grade;
};

Student s;
s.name = "Аня";
s.grade = 4;

Student *p = s;          // ошибка 1?
cout << p.name;          // ошибка 2?
p->grade = p->grade + 1;
cout << s.grade;
```

---

**Задание 4 (14 баллов)** — *Урок 8. Указатели*  
Что выведет код? Поясните работу указателя и разыменования.

```cpp
int x = 4;
int y = 9;
int *px = &x;
int *py = &y;

*px = *px + 3;
*py = *px * 2;
x = x + y;

cout << *px << " " << y;
```

**Ответ:** ___________

---

**Задание 5 (14 баллов)** — *Урок 12. Классы*  
Найдите **все ошибки** в коде класса, исправьте их и кратко объясните правила доступа.

```cpp
class Counter {
    int value;
public:
    Counter(int start) {
        value = start;
    }
    void increment() {
        value++;
    }
    int getValue() {   // должно ли быть const?
        return value;
    }
};

int main() {
    Counter c = 0;           // допустимо?
    c.increment();
    cout << c.value;         // допустимо?
    return 0;
}
```

---

## Критерии оценивания

| Баллы | Оценка |
|-------|--------|
| 85–100 | 5 (отлично) |
| 70–84 | 4 (хорошо) |
| 50–69 | 3 (удовлетворительно) |
| 0–49 | 2 (неудовлетворительно) |
